tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "pivotal/tap"
tap "spring-io/tap"
# Per-project, per-directory shell environments
brew "autoenv"
# Official Amazon AWS command-line interface
brew "awscli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Freely available high-quality data compressor
brew "bzip2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# GNU compiler collection
brew "gcc"
# Fulltext search engine and column store
brew "groonga"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Open source relational database management system
brew "mysql"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# High-performance system programming language
brew "swift"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "spring-io/tap/spring-boot"
# 3D creation suite
cask "blender"
# Scriptable scratchpad for developers
cask "boop"
# Cut and paste files in Finder
cask "command-x"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
cask "font-fira-code"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Clipboard manager
cask "maccy"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "arcanis.vscode-zipfs"
vscode "bajdzis.vscode-database"
vscode "be5invis.vscode-custom-css"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "chris-noring.node-snippets"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "degreat.3e"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzhavat.css-initial-value"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "infeng.vscode-react-typescript"
vscode "janne252.fontawesome-autocomplete"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "mtxr.sqltools"
vscode "octref.vetur"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "sdras.vue-vscode-snippets"
vscode "simonsiefke.svg-preview"
vscode "solnurkarim.html-to-css-autocompletion"
vscode "styled-components.vscode-styled-components"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "wayou.vscode-todo-highlight"
vscode "zhuangtongfa.material-theme"
